from __future__ import unicode_literals
from django.db import migrations

class Migration(migrations.Migration):
    dependencies = [
        ('shoppingapp', '0001_initial'),
    ]

    operations = [
        migrations.RunSQL("INSERT INTO shoppingapp_categories VALUES "\
                          "(1, 'คอมพิวเตอร์', 'คอมพิวเตอร์และอุปกรณ์ต่อพ่วง เทคโนโลยีสารสนเทศ และระบบเครือข่าย'),"\
                          "(2, 'อุปกรณ์สนาม', 'ลูกระเบิด'), "\
                          "(3, 'เครื่องใช้ไฟฟ้า','เครื่องใช้ไฟฟ้าและอุปกรณ์ทางอิเล็กทรอนิกส์ต่างๆ ที่ใช้กระแสไฟฟ้าในการทำงาน'),"\
                          "(4, 'เครื่องสำอาง', 'สินค้าสำหรับดูแลเรือนร่างชายหญิงต่าง ๆ'), "\
                          "(5, 'เครื่องดื่มแอลกอฮอล์', 'เหล้ายาปลาปิ้ง สำหรับผ่อนคลาย');"
                          ),
        migrations.RunSQL("INSERT INTO shoppingapp_products VALUES "\
                          "('c001', 'Keyboard', 1500, 100, '/products/c001.jpg', 1),"\
                          "('c002', 'Mouse', 1200, 500, '/products/c002.jpg', 1), " \
                          "('c003', 'Scanner', 2000, 100, '/products/c003.jpg', 1), " \
                          "('c004', 'Joy Strick', 3000, 100, '/products/c004.jpg', 1), " \
                          "('c005', 'Printer', 5500, 100, '/products/c005.jpg', 1), " \
                          "('c007', 'bbb', 100, 100, '/products/c007.jpg', 1), " \
                          "('C009', 'Long Gun', 25000, 10, '/products/C009.jpg', 2);"
                          ),
        migrations.RunSQL("INSERT INTO shoppingapp_samplesale VALUES "\
                          "(1,'2565-01-01',15000,'c001'),(2,'2565-02-01',5000,'c001'),"\
                          "(3,'2565-03-01',50000,'c001'),(4,'2565-01-01',1000,'c002'),"\
                          "(5,'2565-02-01',20000,'c002'),(6,'2565-03-01',5500,'c002'),"\
                          "(7,'2565-01-01',5000,'c003'),(8,'2565-02-01',1000,'c003'),"\
                          "(9,'2565-03-01',65000,'c003'),(10,'2565-01-01',20000,'c004'),"\
                          "(11,'2565-02-01',5000,'c004'),(12,'2565-03-01',1400,'c004'),"\
                          "(13,'2565-01-01',16000,'c005'),(14,'2565-03-04',10000,'c005'),"\
                          "(15,'2565-03-05',20000,'c005'),(16,'2565-04-15',30000,'c005'),"\
                          "(17,'2565-05-05',55000,'c007'),(18,'2565-07-07',1000,'c007'),"\
                          "(19,'2565-05-10',5000,'c007'),(20,'2565-08-09',95000,'C009');")

    ]
